CircuitMess/Arduino-ESP32/boards.txt
##############################################################

wheelson.name=Wheelson by CircuitMess

wheelson.vid.0=0x1a86
wheelson.pid.0=0x7523

wheelson.upload.tool=esptool_py
wheelson.upload.maximum_size=1310720
wheelson.upload.maximum_data_size=327680
wheelson.upload.wait_for_upload_port=false

wheelson.serial.disableDTR=true
wheelson.serial.disableRTS=true

wheelson.build.mcu=esp32
wheelson.build.core=esp32
wheelson.build.variant=wheelson
wheelson.build.board=CM_WHEELSON

wheelson.build.f_cpu=240000000L
wheelson.build.flash_size=4MB
wheelson.build.flash_freq=40m
wheelson.build.flash_mode=dio
wheelson.build.boot=dio
wheelson.build.partitions=default
wheelson.build.defines=-DCONFIG_ARDUINO_LOOP_STACK_SIZE=14000 -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_U8G2FONTS -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DST7735_DRIVER -DTFT_RGB_ORDER=TFT_BGR -DTFT_WIDTH=128 -DTFT_HEIGHT=160 -DTFT_MISO=-1 -DTFT_MOSI=13 -DTFT_SCLK=2 -DTFT_CS=32 -DTFT_DC=12 -DTFT_RST=-1 -DSPI_FREQUENCY=27000000 -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=1 -DCONFIG_SPIRAM_USE_MALLOC=1 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MALLOC -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1
wheelson.build.extra_flags=-O2 -g

wheelson.menu.PartitionScheme.min_spiffs=No OTA
wheelson.menu.PartitionScheme.min_spiffs.build.partitions=noota_4MB
wheelson.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
wheelson.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
wheelson.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x383000

wheelson.menu.FlashFreq.80=80MHz
wheelson.menu.FlashFreq.80.build.flash_freq=80m

wheelson.menu.UploadSpeed.921600=921600
wheelson.menu.UploadSpeed.921600.upload.speed=921600
wheelson.menu.UploadSpeed.115200=115200
wheelson.menu.UploadSpeed.115200.upload.speed=115200
wheelson.menu.UploadSpeed.256000.windows=256000
wheelson.menu.UploadSpeed.256000.upload.speed=256000
wheelson.menu.UploadSpeed.230400.windows.upload.speed=256000
wheelson.menu.UploadSpeed.230400=230400
wheelson.menu.UploadSpeed.230400.upload.speed=230400
wheelson.menu.UploadSpeed.460800.linux=460800
wheelson.menu.UploadSpeed.460800.macosx=460800
wheelson.menu.UploadSpeed.460800.upload.speed=460800
wheelson.menu.UploadSpeed.512000.windows=512000
wheelson.menu.UploadSpeed.512000.upload.speed=512000

wheelson.menu.DebugLevel.none=None
wheelson.menu.DebugLevel.none.build.code_debug=0

wheelson.bootloader.tool=wheelfirm
wheelson.bootloader.tool.firmware=wheelson/firmware.bin

##############################################################

byteboi.name=ByteBoi by CircuitMess

byteboi.vid.0=0x1a86
byteboi.pid.0=0x7523

byteboi.upload.tool=esptool_py
byteboi.upload.maximum_size=1310720
byteboi.upload.maximum_data_size=327680
byteboi.upload.wait_for_upload_port=false

byteboi.serial.disableDTR=true
byteboi.serial.disableRTS=true

byteboi.build.mcu=esp32
byteboi.build.core=esp32
byteboi.build.variant=byteboi
byteboi.build.board=CM_BYTEBOI

byteboi.build.f_cpu=240000000L
byteboi.build.flash_size=4MB
byteboi.build.flash_freq=40m
byteboi.build.flash_mode=dio
byteboi.build.boot=dio
byteboi.build.partitions=default
byteboi.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_U8G2FONTS -DCIRCUITOS_LOVYANGFX -DLOVYAN_MANUAL -DCIRCUITOS_LOVYANGFX_ZOOM=2 -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=1 -DCONFIG_SPIRAM_MEMTEST=0 -DCONFIG_SPIRAM_USE_MEMMAP=1 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MEMMAP -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1
byteboi.build.extra_flags=-Os -g

byteboi.menu.PartitionScheme.game=Game for launcher (1MB SPIFFS)
byteboi.menu.PartitionScheme.game.build.partitions=byteboi
byteboi.menu.PartitionScheme.game.upload.maximum_size=2097152
byteboi.menu.PartitionScheme.game.upload.binary_start=0x110000
byteboi.menu.PartitionScheme.game.upload.spiffs_start=0x11000

byteboi.menu.PartitionScheme.standalone=Standalone game (1MB SPIFFS)
byteboi.menu.PartitionScheme.standalone.build.partitions=byteboi
byteboi.menu.PartitionScheme.standalone.upload.maximum_size=3080192
byteboi.menu.PartitionScheme.standalone.upload.binary_start=0x110000
byteboi.menu.PartitionScheme.standalone.upload.spiffs_start=0x11000

byteboi.menu.PartitionScheme.standalone_big=Big standalone game (0.5MB SPIFFS)
byteboi.menu.PartitionScheme.standalone_big.build.partitions=byteboi_big
byteboi.menu.PartitionScheme.standalone_big.upload.maximum_size=3604480
byteboi.menu.PartitionScheme.standalone_big.upload.binary_start=0x90000
byteboi.menu.PartitionScheme.standalone_big.upload.spiffs_start=0x11000

byteboi.menu.PartitionScheme.launcher=Launcher
byteboi.menu.PartitionScheme.launcher.build.partitions=byteboi_launcher
byteboi.menu.PartitionScheme.launcher.upload.maximum_size=983040
byteboi.menu.PartitionScheme.launcher.upload.binary_start=0x110000
byteboi.menu.PartitionScheme.launcher.upload.spiffs_start=0x11000
byteboi.menu.PartitionScheme.launcher.build.pscheme_defines=-DBYTEBOI_LAUNCHER

byteboi.menu.FlashFreq.80=80MHz
byteboi.menu.FlashFreq.80.build.flash_freq=80m

byteboi.menu.UploadSpeed.921600=921600
byteboi.menu.UploadSpeed.921600.upload.speed=921600
byteboi.menu.UploadSpeed.115200=115200
byteboi.menu.UploadSpeed.115200.upload.speed=115200
byteboi.menu.UploadSpeed.256000.windows=256000
byteboi.menu.UploadSpeed.256000.upload.speed=256000
byteboi.menu.UploadSpeed.230400.windows.upload.speed=256000
byteboi.menu.UploadSpeed.230400=230400
byteboi.menu.UploadSpeed.230400.upload.speed=230400
byteboi.menu.UploadSpeed.460800.linux=460800
byteboi.menu.UploadSpeed.460800.macosx=460800
byteboi.menu.UploadSpeed.460800.upload.speed=460800
byteboi.menu.UploadSpeed.512000.windows=512000
byteboi.menu.UploadSpeed.512000.upload.speed=512000

byteboi.menu.DebugLevel.none=None
byteboi.menu.DebugLevel.none.build.code_debug=0

byteboi.bootloader.tool=bbfirm
byteboi.bootloader.tool.firmware=byteboi/firmware.bin

##############################################################

synthia.name=Synthia by CircuitMess

synthia.vid.0=0x1a86
synthia.pid.0=0x7523

synthia.upload.tool=esptool_py
synthia.upload.maximum_size=1310720
synthia.upload.maximum_data_size=327680
synthia.upload.wait_for_upload_port=false

synthia.serial.disableDTR=true
synthia.serial.disableRTS=true

