CircuitMess/Arduino-ESP32/boards.txt
synthia.build.mcu=esp32
synthia.build.core=esp32
synthia.build.variant=synthia
synthia.build.board=CM_SYNTHIA

synthia.build.f_cpu=240000000L
synthia.build.flash_size=4MB
synthia.build.flash_freq=40m
synthia.build.flash_mode=dio
synthia.build.boot=dio
synthia.build.partitions=default
synthia.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DTFT_OFF -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=1 -DCONFIG_SPIRAM_MEMTEST=0 -DCONFIG_SPIRAM_USE_MALLOC=1 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MALLOC -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1 -DDEBUG
synthia.build.extra_flags=-O2 -g

synthia.menu.PartitionScheme.min_spiffs=No OTA
synthia.menu.PartitionScheme.min_spiffs.build.partitions=no_ota
synthia.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
synthia.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
synthia.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x211000

synthia.menu.FlashFreq.80=80MHz
synthia.menu.FlashFreq.80.build.flash_freq=80m

synthia.menu.UploadSpeed.921600=921600
synthia.menu.UploadSpeed.921600.upload.speed=921600
synthia.menu.UploadSpeed.115200=115200
synthia.menu.UploadSpeed.115200.upload.speed=115200
synthia.menu.UploadSpeed.256000.windows=256000
synthia.menu.UploadSpeed.256000.upload.speed=256000
synthia.menu.UploadSpeed.230400.windows.upload.speed=256000
synthia.menu.UploadSpeed.230400=230400
synthia.menu.UploadSpeed.230400.upload.speed=230400
synthia.menu.UploadSpeed.460800.linux=460800
synthia.menu.UploadSpeed.460800.macosx=460800
synthia.menu.UploadSpeed.460800.upload.speed=460800
synthia.menu.UploadSpeed.512000.windows=512000
synthia.menu.UploadSpeed.512000.upload.speed=512000

synthia.menu.DebugLevel.none=None
synthia.menu.DebugLevel.none.build.code_debug=0

synthia.bootloader.tool=synthfirm
synthia.bootloader.tool.firmware=synthia/firmware.bin

##############################################################

chatter.name=Chatter by CircuitMess

chatter.vid.0=0x1a86
chatter.pid.0=0x7523

chatter.upload.tool=esptool_py
chatter.upload.maximum_size=1310720
chatter.upload.maximum_data_size=327680
chatter.upload.wait_for_upload_port=false

chatter.serial.disableDTR=true
chatter.serial.disableRTS=true

chatter.build.mcu=esp32
chatter.build.core=esp32
chatter.build.variant=chatter
chatter.build.board=CM_CHATTER

chatter.build.f_cpu=240000000L
chatter.build.flash_size=4MB
chatter.build.flash_freq=40m
chatter.build.flash_mode=dio
chatter.build.boot=dio
chatter.build.partitions=default
chatter.build.defines=-DCONFIG_ARDUINO_LOOP_STACK_SIZE=14000 -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_PIEZO_PWM -DCIRCUITOS_PIEZO_PWM_CHANNEL=15 -DCIRCUITOS_LOVYANGFX -DLOVYAN_PANEL=Panel_ST7735S -DLOVYAN_FREQ=27000000 -DLOVYAN_WIDTH=128 -DLOVYAN_HEIGHT=160 -DLOVYAN_MISO=-1 -DLOVYAN_MOSI=26 -DLOVYAN_SCK=27 -DLOVYAN_CS=-1 -DLOVYAN_DC=33 -DLOVYAN_RST=15 -DRADIOLIB_GODMODE
chatter.build.extra_flags=-O2 -g

chatter.menu.PartitionScheme.min_spiffs=No OTA
chatter.menu.PartitionScheme.min_spiffs.build.partitions=no_ota
chatter.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
chatter.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
chatter.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x211000

chatter.menu.FlashFreq.80=80MHz
chatter.menu.FlashFreq.80.build.flash_freq=80m

chatter.menu.UploadSpeed.921600=921600
chatter.menu.UploadSpeed.921600.upload.speed=921600
chatter.menu.UploadSpeed.115200=115200
chatter.menu.UploadSpeed.115200.upload.speed=115200
chatter.menu.UploadSpeed.256000.windows=256000
chatter.menu.UploadSpeed.256000.upload.speed=256000
chatter.menu.UploadSpeed.230400.windows.upload.speed=256000
chatter.menu.UploadSpeed.230400=230400
chatter.menu.UploadSpeed.230400.upload.speed=230400
chatter.menu.UploadSpeed.460800.linux=460800
chatter.menu.UploadSpeed.460800.macosx=460800
chatter.menu.UploadSpeed.460800.upload.speed=460800
chatter.menu.UploadSpeed.512000.windows=512000
chatter.menu.UploadSpeed.512000.upload.speed=512000

chatter.menu.DebugLevel.none=None
chatter.menu.DebugLevel.none.build.code_debug=0

chatter.bootloader.tool=chatfirm
chatter.bootloader.tool.firmware=chatter/firmware.bin

##############################################################

circuitpet.name=CircuitPet by CircuitMess

circuitpet.vid.0=0x1a86
circuitpet.pid.0=0x7523

circuitpet.upload.tool=esptool_py
circuitpet.upload.maximum_size=1310720
circuitpet.upload.maximum_data_size=327680
circuitpet.upload.wait_for_upload_port=false

circuitpet.serial.disableDTR=true
circuitpet.serial.disableRTS=true

circuitpet.build.mcu=esp32
circuitpet.build.core=esp32
circuitpet.build.variant=circuitpet
circuitpet.build.board=CM_CIRCUITPET

circuitpet.build.f_cpu=240000000L
circuitpet.build.flash_size=4MB
circuitpet.build.flash_freq=40m
circuitpet.build.flash_mode=dio
circuitpet.build.boot=dio
circuitpet.build.partitions=default
circuitpet.build.defines=-DCONFIG_ARDUINO_LOOP_STACK_SIZE=14000 -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_PIEZO_PWM -DCIRCUITOS_PIEZO_PWM_CHANNEL=15 -DCIRCUITOS_LOVYANGFX -DLOVYAN_MANUAL
circuitpet.build.extra_flags=-O2 -g

circuitpet.menu.PartitionScheme.min_spiffs=No OTA
circuitpet.menu.PartitionScheme.min_spiffs.build.partitions=noota_3g
circuitpet.menu.PartitionScheme.min_spiffs.upload.maximum_size=1048576
circuitpet.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
circuitpet.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x111000

circuitpet.menu.FlashFreq.80=80MHz
circuitpet.menu.FlashFreq.80.build.flash_freq=80m

circuitpet.menu.UploadSpeed.921600=921600
circuitpet.menu.UploadSpeed.921600.upload.speed=921600
circuitpet.menu.UploadSpeed.115200=115200
circuitpet.menu.UploadSpeed.115200.upload.speed=115200
circuitpet.menu.UploadSpeed.256000.windows=256000
circuitpet.menu.UploadSpeed.256000.upload.speed=256000
circuitpet.menu.UploadSpeed.230400.windows.upload.speed=256000
circuitpet.menu.UploadSpeed.230400=230400
circuitpet.menu.UploadSpeed.230400.upload.speed=230400
circuitpet.menu.UploadSpeed.460800.linux=460800
circuitpet.menu.UploadSpeed.460800.macosx=460800
circuitpet.menu.UploadSpeed.460800.upload.speed=460800
circuitpet.menu.UploadSpeed.512000.windows=512000
circuitpet.menu.UploadSpeed.512000.upload.speed=512000

